Benchmark Automation/Sysbench/results/azure_vm_20260107/sysbench_fileio.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 2MiB each
256MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      400.53
    writes/s:                     267.02
    fsyncs/s:                     854.52

Throughput:
    read, MiB/s:                  6.26
    written, MiB/s:               4.17

General statistics:
    total time:                          240.1313s
    total number of events:              365370

Latency (ms):
         min:                                    0.00
         avg:                                    0.66
         max:                                   63.87
         95th percentile:                        3.19
         sum:                               239679.60

Threads fairness:
    events (avg/stddev):           365370.0000/0.00
    execution time (avg/stddev):   239.6796/0.00